Revit 2027 API
WireType.WireMaterial Property
 The conductor material of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId WireMaterial { get; set; }
Public Property WireMaterial As ElementId
	Get
	Set
public:
property ElementId^ WireMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
member WireMaterial : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a conductor material id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace